app/Controllers/Auth.php

                $clave = $this->request->getVar('clave');
                log_message('info', 'User credentials received: ' . $correo);

                $datosUser = $this->usuarios->where(['correo' => $correo, 'estado' => 1])->first();
---
SELECT *
FROM `usuarios`
WHERE `correo` = 'Superadmin@jtdesarrolloweb.com'
AND `estado` = 1
 LIMIT 1

                    if (password_verify($clave, $datosUser['clave'])) {
                        log_message('info', 'Password verified successfully.');

                        $roles = $this->roles->find(1); //$datosUser['id_rol']
---
SELECT *
FROM `roles`
WHERE `roles`.`id` = 1